bortsov/NUC970_NuWriter/NuWriterFW/NuWriterFW/source/sd.c
/******************************************************************************
 * @file     SD.c
 * @version  V0.10
 * $Revision: 1 $
 * $Date: 13/07/10 1:17p $
 * @brief    NUC970 series SD driver source file
 *
 * @note
 * Copyright (C) 2013 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/

#include "nuc970_reg.h"
#include "wblib.h"
#include "sd.h"
#include "usbd.h"


#define SD_BLOCK_SIZE   512

//#define SD_INITCOUNT 2000
//#define SD_TICKCOUNT  1000

// global variables
// For response R3 (such as ACMD41, CRC-7 is invalid; but SD controller will still
//      calculate CRC-7 and get an error result, software should ignore this error and clear SDISR [CRC_IF] flag
//      _sdio_uR3_CMD is the flag for it. 1 means software should ignore CRC-7 error
uint32_t _sd_uR3_CMD=0;
uint32_t _sd_uR7_CMD=0;

uint8_t *_sd_pSDHCBuffer;
uint32_t _sd_ReferenceClock;

__align(4096) uint8_t _sd_ucSDHCBuffer[64];

void SD_CheckRB()
{
    while(1)
    {
        outpw(REG_NAND_SDCSR, inpw(REG_NAND_SDCSR)|SD_CSR_CLK8_OE);
        while(inpw(REG_NAND_SDCSR) & SD_CSR_CLK8_OE);
        if (inpw(REG_NAND_SDISR) & SD_ISR_DATA0)
            break;
    }
}


int SD_SDCommand(struct FMI_SD_INFO *pSD, uint8_t ucCmd, uint32_t uArg)
{
    outpw(REG_NAND_SDARG, uArg);
    outpw(REG_NAND_SDCSR, (inpw(REG_NAND_SDCSR)&(~SD_CSR_CMD_MASK))|(ucCmd << 8)|(SD_CSR_CO_EN));

    while(inpw(REG_NAND_SDCSR) & SD_CSR_CO_EN);
    return Successful;
}


int SD_SDCmdAndRsp(struct FMI_SD_INFO *pSD, uint8_t ucCmd, uint32_t uArg, int ntickCount)
{
    outpw(REG_NAND_SDARG, uArg);
    outpw(REG_NAND_SDCSR, (inpw(REG_NAND_SDCSR)&(~SD_CSR_CMD_MASK))|(ucCmd << 8)|(SD_CSR_CO_EN | SD_CSR_RI_EN));

    if (ntickCount > 0)
    {
        while(inpw(REG_NAND_SDCSR) & SD_CSR_RI_EN)
        {
            if(ntickCount-- == 0) {
                outpw(REG_NAND_SDCSR, inpw(REG_NAND_SDCSR)|SD_CSR_SWRST);   // reset SD engine
                return 2;
            }
        }
    }
    else
    {
        while(inpw(REG_NAND_SDCSR) & SD_CSR_RI_EN);
    }

    if (_sd_uR7_CMD)
    {
        if (((inpw(REG_NAND_SDRSP1) & 0xff) != 0x55) && ((inpw(REG_NAND_SDRSP0) & 0xf) != 0x01))
        {
            _sd_uR7_CMD = 0;
            return SD_CMD8_ERROR;
        }
    }

    if (!_sd_uR3_CMD)
    {
        if (inpw(REG_NAND_SDISR) & SD_ISR_CRC7_OK)      // check CRC7
            return Successful;
        else
            return SD_CRC7_ERROR;
    }
    else    // ignore CRC error for R3 case
    {
        _sd_uR3_CMD = 0;
        outpw(REG_NAND_SDISR, SD_ISR_CRC_IF);
        return Successful;
    }
}


int SD_Swap32(int val)
{
    int buf;

    buf = val;
    val <<= 24;
    val |= (buf<<8)&0xff0000;
    val |= (buf>>8)&0xff00;
    val |= (buf>>24)&0xff;
    return val;
}

// Get 16 bytes CID or CSD
int SD_SDCmdAndRsp2(struct FMI_SD_INFO *pSD, uint8_t ucCmd, uint32_t uArg, uint32_t *puR2ptr)
{
    unsigned int i;
    unsigned int tmpBuf[5];

    outpw(REG_NAND_SDARG, uArg);
    outpw(REG_NAND_SDCSR, (inpw(REG_NAND_SDCSR)&(~SD_CSR_CMD_MASK))|(ucCmd << 8)|(SD_CSR_CO_EN | SD_CSR_R2_EN));

    while(inpw(REG_NAND_SDCSR) & SD_CSR_R2_EN);

    if (inpw(REG_NAND_SDISR) & SD_ISR_CRC7_OK)
    {
        for (i=0; i<5; i++)
            tmpBuf[i] = SD_Swap32(inpw(REG_NAND_FB0+i*4));

        for (i=0; i<4; i++)
            *puR2ptr++ = ((tmpBuf[i] & 0x00ffffff)<<8) | ((tmpBuf[i+1] & 0xff000000)>>24);
        return Successful;
    }
    else
        return SD_CRC7_ERROR;
}


int SD_SDCmdAndRspDataIn(struct FMI_SD_INFO *pSD, uint8_t ucCmd, uint32_t uArg)
{
    volatile int buf;

    outpw(REG_NAND_SDARG, uArg);
    outpw(REG_NAND_SDCSR, (inpw(REG_NAND_SDCSR)&(~SD_CSR_CMD_MASK))|(ucCmd << 8)|(SD_CSR_CO_EN | SD_CSR_RI_EN | SD_CSR_DI_EN));

    while (inpw(REG_NAND_SDCSR) & SD_CSR_RI_EN);

    while (inpw(REG_NAND_SDCSR) & SD_CSR_DI_EN);

    if (!(inpw(REG_NAND_SDISR) & SD_ISR_CRC7_OK)) {     // check CRC7
        return SD_CRC7_ERROR;
    }

    if (!(inpw(REG_NAND_SDISR) & SD_ISR_CRC16_OK)) {    // check CRC16
        return SD_CRC16_ERROR;
    }
    return Successful;
}

/*-----------------------------------------------------------------------------
 * 2011/6/24 by CJChen1@nuvoton.com, To set up the clock for SD_CLK
 *      SD_CLK = UPLL / ((CLKDIV2[SD_N0] + 1) * (CLKDIV2[SD_N1] + 1))
 *      Support both FPGA board and real chip.
 *          FPGA board don't support CLKDIV2[SD_N0] divider.
 *      INPUT: sd_clock_khz: the SD clock you wanted with unit KHz.
 *---------------------------------------------------------------------------*/
// there are 3 bits for divider N0, maximum is 8
#define SD_CLK_DIV0_MAX     8
// there are 8 bits for divider N1, maximum is 256
#define SD_CLK_DIV1_MAX     256

void SD_Set_clock(uint32_t sd_clock_khz)
{
    uint32_t rate, div0, div1, i;

    rate = _sd_ReferenceClock / sd_clock_khz;

    // choose slower clock if system clock cannot divisible by wanted clock
    if (_sd_ReferenceClock % sd_clock_khz != 0)
        rate++;

    if (rate >= (SD_CLK_DIV0_MAX * SD_CLK_DIV1_MAX)) { // the maximum divider for SD_CLK is (SD_CLK_DIV0_MAX * SD_CLK_DIV1_MAX)
        rate = SD_CLK_DIV0_MAX * SD_CLK_DIV1_MAX;
    }

    for (div0 = SD_CLK_DIV0_MAX; div0 > 0; div0--) {  // choose the maximum value if can exact division
        if (rate % div0 == 0)
            break;
    }
    if (div0 == 0) { // cannot exact division
        // if rate <= SD_CLK_DIV1_MAX, set div0 to 1 since div1 can exactly divide input clock
        div0 = (rate <= SD_CLK_DIV1_MAX) ? 1 : SD_CLK_DIV0_MAX;
    }

    //--- calculate the second divider
    div1 = rate / div0;
    div1 &= 0xFF;

    MSG_DEBUG("fmiSD_Set_clock(): wanted clock=%d, rate=%d, div0=%d, div1=%d\n", sd_clock_khz, rate, div0, div1);

    //--- setup register
    //outpw(REG_CLKDIV3, (inpw(REG_CLKDIV3) & ~0x18) | (0x0 << 3));       // SD clock from XIN [4:3]
    outpw(REG_CLKDIV3, (inpw(REG_CLKDIV3) & ~0x18) | (0x3 << 3));       // SD clock from UPLL [4:3]
    outpw(REG_CLKDIV3, (inpw(REG_CLKDIV3) & ~0x7) | (div0-1));                 // SD clock divided by CLKDIV3[SD_N] [2:0]
    outpw(REG_CLKDIV3, (inpw(REG_CLKDIV3) & ~0xff00) | ((div1-1) << 8)); // SD clock divided by CLKDIV3[SD_N] [15:8]
    for(i=0; i<1000; i++);  // waiting for clock become stable
    MSG_DEBUG("clock: 0x%x\n", inpw(REG_CLKDIV3));
    return;
}

// Initial
int SD_Init(struct FMI_SD_INFO *pSD)
{
    int volatile i, status;
    unsigned int resp;
    unsigned int CIDBuffer[4];
    unsigned int volatile u32CmdTimeOut;

    // set the clock to 200KHz
    SD_Set_clock(300);
    //SD_Set_clock(50);
    // power ON 74 clock
    outpw(REG_NAND_SDCSR, inpw(REG_NAND_SDCSR) | SD_CSR_CLK74_OE);
    while(inpw(REG_NAND_SDCSR) & SD_CSR_CLK74_OE);

    SD_SDCommand(pSD, 0, 0);        // reset all cards
    for (i=0x100; i>0; i--);

