bortsov/NUC970_NuWriter/NuWriterFW/NuWriterFW/source/sd.c
    // initial SDHC
    _sd_uR7_CMD = 1;
    u32CmdTimeOut = 5000;

    i = SD_SDCmdAndRsp(pSD, 8, 0x00000155, u32CmdTimeOut);
    MSG_DEBUG("CMD8 i=0x%08x,Successful=0x%08x\n",i,Successful);
    if (i == Successful)
    {
        // SD 2.0
        SD_SDCmdAndRsp(pSD, 55, 0x00, u32CmdTimeOut);
        _sd_uR3_CMD = 1;
        SD_SDCmdAndRsp(pSD, 41, 0x40ff8000, u32CmdTimeOut); // 2.7v-3.6v
        resp = inpw(REG_NAND_SDRSP0);
        while (!(resp & 0x00800000)) {      // check if card is ready
            SD_SDCmdAndRsp(pSD, 55, 0x00, u32CmdTimeOut);
            _sd_uR3_CMD = 1;
            SD_SDCmdAndRsp(pSD, 41, 0x40ff8000, u32CmdTimeOut); // 3.0v-3.4v
            resp = inpw(REG_NAND_SDRSP0);
        }
        if (resp & 0x00400000)
            pSD->uCardType = SD_TYPE_SD_HIGH;
        else
            pSD->uCardType = SD_TYPE_SD_LOW;
    }
    else
    {
        // SD 1.1				 
        SD_SDCommand(pSD, 0, 0);        // reset all cards
        for (i=0x100; i>0; i--);

        i = SD_SDCmdAndRsp(pSD, 55, 0x00, u32CmdTimeOut);
        if (i == 2) {   // MMC memory
            SD_SDCommand(pSD, 0, 0);        // reset
            for (i=0x100; i>0; i--);

            _sd_uR3_CMD = 1;
            if (SD_SDCmdAndRsp(pSD, 1, 0x40ff8080, u32CmdTimeOut) != 2) // eMMC memory
            {
                resp = inpw(REG_NAND_SDRSP0);
                while (!(resp & 0x00800000))        // check if card is ready
                {
                    _sd_uR3_CMD = 1;
                    SD_SDCmdAndRsp(pSD, 1, 0x40ff8080, u32CmdTimeOut);      // high voltage
                    resp = inpw(REG_NAND_SDRSP0);
                }
                pSD->uCardType = SD_TYPE_EMMC;
            }
            else
            {							  
                SD_SDCommand(pSD, 0, 0);        // reset
                for (i=0x100; i>0; i--){;}
                i=SD_SDCmdAndRsp(pSD, 1, 0x80ff8000, u32CmdTimeOut);
                MSG_DEBUG("i=SD_SDCmdAndRs i=%d\n",i);
                if ( i!= 2) // MMC memory
                {
                    resp = inpw(REG_NAND_SDRSP0);
                    while (!(resp & 0x00800000)) {      // check if card is ready
                        _sd_uR3_CMD = 1;
                        SD_SDCmdAndRsp(pSD, 1, 0x80ff8000, u32CmdTimeOut);      // high voltage
                        resp = inpw(REG_NAND_SDRSP0);
                    }
                    pSD->uCardType = SD_TYPE_MMC;
                }else{
                    pSD->uCardType = SD_TYPE_UNKNOWN;
                    return SD_ERR_DEVICE;
                }
            }
        }
        else if (i == 0)    // SD Memory
        {
					  int count=10;
            _sd_uR3_CMD = 1;
            SD_SDCmdAndRsp(pSD, 41, 0x00ff8000, u32CmdTimeOut); // 3.0v-3.4v
            resp = inpw(REG_NAND_SDRSP0);
            while (!(resp & 0x00800000) && count>0) {      // check if card is ready
                SD_SDCmdAndRsp(pSD, 55, 0x00,u32CmdTimeOut);
                _sd_uR3_CMD = 1;
                SD_SDCmdAndRsp(pSD, 41, 0x00ff8000, u32CmdTimeOut); // 3.0v-3.4v
                resp = inpw(REG_NAND_SDRSP0);
                count--;
            }
            if(count<=0) {
                pSD->uCardType = SD_TYPE_UNKNOWN;
                return SD_INIT_ERROR;
            }
            pSD->uCardType = SD_TYPE_SD_LOW;
        } else {
            pSD->uCardType = SD_TYPE_UNKNOWN;
            return SD_INIT_ERROR;
        }
    }

    // CMD2, CMD3
    if (pSD->uCardType != SD_TYPE_UNKNOWN)
    {
        SD_SDCmdAndRsp2(pSD, 2, 0x00, CIDBuffer);
        if ((pSD->uCardType == SD_TYPE_MMC) || (pSD->uCardType == SD_TYPE_EMMC))
        {
            if ((status = SD_SDCmdAndRsp(pSD, 3, 0x10000, 0)) != Successful)        // set RCA
                return status;
            pSD->uRCA = 0x10000;
        }
        else
        {
            if ((status = SD_SDCmdAndRsp(pSD, 3, 0x00, 0)) != Successful)       // get RCA
                return status;
            else
                pSD->uRCA = (inpw(REG_NAND_SDRSP0) << 8) & 0xffff0000;
        }
    }

    if (pSD->uCardType == SD_TYPE_SD_HIGH)
        MSG_DEBUG("This is high capacity SD memory card\n");
    if (pSD->uCardType == SD_TYPE_SD_LOW)
        MSG_DEBUG("This is standard capacity SD memory card\n");
    if (pSD->uCardType == SD_TYPE_MMC)
        MSG_DEBUG("This is MMC memory card\n");
    if (pSD->uCardType == SD_TYPE_EMMC)
        MSG_DEBUG("This is eMMC memory card\n");

    SD_Set_clock(50000);
    return Successful;
}


int SD_SwitchToHighSpeed(struct FMI_SD_INFO *pSD)
{
    int volatile status=0;
    uint16_t current_comsumption, busy_status0;

    outpw(REG_NAND_DMACSAR, (uint32_t)_sd_pSDHCBuffer);   // set DMA transfer starting address
    outpw(REG_NAND_SDBLEN, 63); // 512 bit

    if ((status = SD_SDCmdAndRspDataIn(pSD, 6, 0x00ffff01)) != Successful)
        return Fail;

    current_comsumption = _sd_pSDHCBuffer[0]<<8 | _sd_pSDHCBuffer[1];
    if (!current_comsumption)
        return Fail;

    busy_status0 = _sd_pSDHCBuffer[28]<<8 | _sd_pSDHCBuffer[29];

    if (!busy_status0) { // function ready
        outpw(REG_NAND_DMACSAR, (uint32_t)_sd_pSDHCBuffer);   // set DMA transfer starting address
        outpw(REG_NAND_SDBLEN, 63); // 512 bit

        if ((status = SD_SDCmdAndRspDataIn(pSD, 6, 0x80ffff01)) != Successful)
            return Fail;

        // function change timing: 8 clocks
        outpw(REG_NAND_SDCSR, inpw(REG_NAND_SDCSR)|SD_CSR_CLK8_OE);
        while(inpw(REG_NAND_SDCSR) & SD_CSR_CLK8_OE);

        current_comsumption = _sd_pSDHCBuffer[0]<<8 | _sd_pSDHCBuffer[1];
        if (!current_comsumption)
            return Fail;

        return Successful;
    }
    else
        return Fail;
}


int SD_SelectCardType(struct FMI_SD_INFO *pSD)
{
    int volatile status=0;

    if ((status = SD_SDCmdAndRsp(pSD, 7, pSD->uRCA, 0)) != Successful)
        return status;

    SD_CheckRB();

    // if SD card set 4bit
    if (pSD->uCardType == SD_TYPE_SD_HIGH)
    {
        _sd_pSDHCBuffer = (uint8_t *)((uint32_t)_sd_ucSDHCBuffer);
        outpw(REG_NAND_DMACSAR, (uint32_t)_sd_pSDHCBuffer);   // set DMA transfer starting address
        outpw(REG_NAND_SDBLEN, 7);  // 64 bit

        if ((status = SD_SDCmdAndRsp(pSD, 55, pSD->uRCA, 0)) != Successful)
            return status;
        if ((status = SD_SDCmdAndRspDataIn(pSD, 51, 0x00)) != Successful)
            return status;

        if ((_sd_ucSDHCBuffer[0] & 0xf) == 0x2)
        {
            status = SD_SwitchToHighSpeed(pSD);
            if (status == Successful)
            {
                /* divider */
                //SD_Set_clock(SDHC_FREQ);
            }
        }

        if ((status = SD_SDCmdAndRsp(pSD, 55, pSD->uRCA, 0)) != Successful)
            return status;
        if ((status = SD_SDCmdAndRsp(pSD, 6, 0x02, 0)) != Successful)   // set bus width
            return status;

        outpw(REG_NAND_SDCSR, inpw(REG_NAND_SDCSR)|SD_CSR_DBW_4BIT);
    }
    else if (pSD->uCardType == SD_TYPE_SD_LOW)
    {
        _sd_pSDHCBuffer = (uint8_t *)((uint32_t)_sd_ucSDHCBuffer);
        outpw(REG_NAND_DMACSAR, (uint32_t)_sd_pSDHCBuffer);   // set DMA transfer starting address
        outpw(REG_NAND_SDBLEN, 7);  // 64 bit

        if ((status = SD_SDCmdAndRsp(pSD, 55, pSD->uRCA, 0)) != Successful)
            return status;
        if ((status = SD_SDCmdAndRspDataIn(pSD, 51, 0x00)) != Successful)
            return status;

        // set data bus width. ACMD6 for SD card, SDCR_DBW for host.
        if ((status = SD_SDCmdAndRsp(pSD, 55, pSD->uRCA, 0)) != Successful)
            return status;

